### Terraform Plan (prod.tfvars)
```
random_integer.eks_postfix: Refreshing state... [id=120]
data.aws_caller_identity.current: Reading...
data.aws_secretsmanager_secret.codebuild[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
data.aws_secretsmanager_secret.codebuild[0]: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9]
data.aws_secretsmanager_secret_version.codebuild_version[0]: Reading...
data.aws_secretsmanager_secret_version.codebuild_version[0]: Read complete after 1s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.codebuild[0].aws_codebuild_project.eks_deploy will be created
  + resource "aws_codebuild_project" "eks_deploy" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 60
      + description          = "Run GitHub Actions jobs to deploy to EKS"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "ce-prj-prd-codebuild"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = (known after apply)
      + tags_all             = (known after apply)

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "NO_ARTIFACTS"
        }

      + cache {
          + modes = [
              + "LOCAL_DOCKER_LAYER_CACHE",
              + "LOCAL_SOURCE_CACHE",
            ]
          + type  = "LOCAL"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/standard:7.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = true
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "EKS_CLUSTER_NAME"
              + type  = "PLAINTEXT"
              + value = "ce-prj-prd-eks-cluster-120"
            }
          + environment_variable {
              + name  = "AWS_REGION"
              + type  = "PLAINTEXT"
              + value = "eu-central-1"
            }
        }

      + logs_config {
          + cloudwatch_logs {
              + group_name = "/aws/codebuild/ce-prj-prd-codebuild"
              + status     = "ENABLED"
            }
        }

      + source {
          + buildspec       = "buildspec.yml"
          + git_clone_depth = 1
          + location        = "https://github.com/Atakannbal/terraform-aws-infra-blueprint.git"
          + type            = "GITHUB"
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnets            = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.codebuild[0].aws_codebuild_source_credential.github will be created
  + resource "aws_codebuild_source_credential" "github" {
      + arn         = (known after apply)
      + auth_type   = "PERSONAL_ACCESS_TOKEN"
      + id          = (known after apply)
      + server_type = "GITHUB"
      + token       = (sensitive value)
    }

  # module.codebuild[0].aws_codebuild_webhook.github will be created
  + resource "aws_codebuild_webhook" "github" {
      + build_type   = "BUILD"
      + id           = (known after apply)
      + payload_url  = (known after apply)
      + project_name = "ce-prj-prd-codebuild"
      + secret       = (sensitive value)
      + url          = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "WORKFLOW_JOB_QUEUED"
              + type                    = "EVENT"
            }
        }
    }

  # module.codebuild[0].aws_iam_role.codebuild_role will be created
  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CodeBuildEKSDeployRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.codebuild[0].aws_iam_role_policy.codebuild_policy will be created
  + resource "aws_iam_role_policy" "codebuild_policy" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                          + "eks:ListClusters",
                          + "eks:AccessKubernetesApi",
                          + "s3:*",
                          + "ecr:*",
                          + "logs:*",
                          + "ssm:GetParameters",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DescribeVpcs",
                          + "ec2:CreateNetworkInterfacePermission",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeAvailabilityZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "CodeBuildEKSDeployRole"
    }

  # module.codebuild[0].aws_security_group.codebuild_sg will be created
  + resource "aws_security_group" "codebuild_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ce-prj-prd-codebuild-sg"
        }
      + tags_all               = {
          + "Name" = "ce-prj-prd-codebuild-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecr[0].aws_ecr_repository.backend will be created
  + resource "aws_ecr_repository" "backend" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ce-prj-prd-backend-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "ce-prj-prd-backend-ecr"
        }
      + tags_all             = {
          + "Name" = "ce-prj-prd-backend-ecr"
        }
    }

  # module.ecr[0].aws_ecr_repository.frontend will be created
  + resource "aws_ecr_repository" "frontend" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ce-prj-prd-frontend-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "ce-prj-prd-frontend-ecr"
        }
      + tags_all             = {
          + "Name" = "ce-prj-prd-frontend-ecr"
        }
    }

  # module.route53[0].aws_route53_zone.primary will be created
  + resource "aws_route53_zone" "primary" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = true
      + id                  = (known after apply)
      + name                = "ce-project-aws.atakanbal.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # module.vpc[0].aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints (ECR/STS)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ce-prj-prd-vpc-endpoints-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.vpc[0].aws_security_group_rule.allow_vpc_to_vpc_endpoints will be created
  + resource "aws_security_group_rule" "allow_vpc_to_vpc_endpoints" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow all VPC traffic to VPC endpoints on 443 (for testing)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc[0].aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc[0].aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc[0].aws_vpc_endpoint.eks will be created
  + resource "aws_vpc_endpoint" "eks" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.eks"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc[0].aws_vpc_endpoint.sts will be created
  + resource "aws_vpc_endpoint" "sts" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.sts"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc[0].module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"                                             = "ce-prj-prd-vpc-default"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all               = {
          + "Name"                                             = "ce-prj-prd-vpc-default"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc[0].module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"                                             = "ce-prj-prd-vpc-default"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all               = {
          + "Name"                                             = "ce-prj-prd-vpc-default"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc[0].module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                             = "ce-prj-prd-vpc-default"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all               = {
          + "Name"                                             = "ce-prj-prd-vpc-default"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                                             = "ce-prj-prd-vpc-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all             = {
          + "Name"                                             = "ce-prj-prd-vpc-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                                             = "ce-prj-prd-vpc"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all = {
          + "Name"                                             = "ce-prj-prd-vpc"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"                                             = "ce-prj-prd-vpc-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all                           = {
          + "Name"                                             = "ce-prj-prd-vpc-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
    }

  # module.vpc[0].module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc[0].module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc[0].module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                                             = "ce-prj-prd-vpc-private"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all         = {
          + "Name"                                             = "ce-prj-prd-vpc-private"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                                             = "ce-prj-prd-vpc-public"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all         = {
          + "Name"                                             = "ce-prj-prd-vpc-public"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                             = "ce-prj-prd-vpc-private-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + tags_all                                       = {
          + "Name"                                             = "ce-prj-prd-vpc-private-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                             = "ce-prj-prd-vpc-private-eu-central-1b"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + tags_all                                       = {
          + "Name"                                             = "ce-prj-prd-vpc-private-eu-central-1b"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                             = "ce-prj-prd-vpc-public-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + tags_all                                       = {
          + "Name"                                             = "ce-prj-prd-vpc-public-eu-central-1a"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                             = "ce-prj-prd-vpc-public-eu-central-1b"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + tags_all                                       = {
          + "Name"                                             = "ce-prj-prd-vpc-public-eu-central-1b"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc[0].module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                                             = "ce-prj-prd-vpc"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
      + tags_all                             = {
          + "Name"                                             = "ce-prj-prd-vpc"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "shared"
        }
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ name_servers                  = [
      - "No name servers available",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Comment -->